; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v9 ?v2)
             (pred_8 ?v3 ?v1)
             (pred_12 ?v9 ?v1)
             (pred_9 ?v6 ?v9 )
	     (pred_11 ?v9)
             (pred_7 ?v8)
             (pred_5 ?v3)
             (pred_3 ?v1)
             (pred_2 ?v9)
             (pred_1 ?v3)
             (pred_6 ?v9)
             (pred_10 ))



(:action op_2
:parameters (?v4 ?v10 ?v5 ?v7)
:precondition (and (pred_7 ?v4) (pred_7 ?v10) (pred_5 ?v5) (pred_3 ?v7)
          (pred_4 ?v4 ?v10) (pred_8 ?v5 ?v7)
                   (pred_12 ?v10 ?v7) (pred_11 ?v4) 
                   (pred_2 ?v10) (pred_1 ?v5))
:effect (and  (pred_6 ?v10) (not (pred_2 ?v10))))


(:action op_4
:parameters (?v4 ?v11)
:precondition (and (pred_7 ?v4) (pred_7 ?v11)
               (pred_11 ?v4) (pred_4 ?v4 ?v11) (pred_6 ?v11))
:effect (and (pred_11 ?v11) (not (pred_11 ?v4))))

(:action op_5
:parameters (?v4 ?v5)
:precondition (and (pred_7 ?v4) (pred_5 ?v5) 
                  (pred_11 ?v4) (pred_9 ?v5 ?v4) (pred_10 ))
:effect (and (pred_1 ?v5)
   (not (pred_9 ?v5 ?v4)) (not (pred_10 ))))


(:action op_1
:parameters (?v4 ?v13 ?v12)
:precondition (and (pred_7 ?v4) (pred_5 ?v13) (pred_5 ?v12)
                  (pred_11 ?v4) (pred_1 ?v12) (pred_9 ?v13 ?v4))
:effect (and (pred_1 ?v13) (pred_9 ?v12 ?v4)
        (not (pred_1 ?v12)) (not (pred_9 ?v13 ?v4))))

(:action op_3
:parameters (?v4 ?v5)
:precondition (and (pred_7 ?v4) (pred_5 ?v5) 
                  (pred_11 ?v4) (pred_1 ?v5))
:effect (and (pred_10 ) (pred_9 ?v5 ?v4) (not (pred_1 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_09 obj_10 obj_20 obj_12 obj_02 obj_11 obj_19 obj_03 obj_18 obj_16 obj_01 obj_08 obj_05 obj_04 obj_13
    obj_14 obj_17
    obj_15 obj_07
    )

    (:init
       (pred_10)

       (pred_7 obj_06)
       (pred_7 obj_09)
       (pred_7 obj_10)
       (pred_7 obj_20)
       (pred_7 obj_12)
       (pred_7 obj_02)
       (pred_7 obj_11)
       (pred_7 obj_19)
       (pred_7 obj_03)
       (pred_7 obj_18)
       (pred_7 obj_16)
       (pred_7 obj_01)
       (pred_7 obj_08)
       (pred_7 obj_05)
       (pred_7 obj_04)
       (pred_7 obj_13)
       (pred_3 obj_14)
       (pred_3 obj_17)
       (pred_5 obj_15)
       (pred_5 obj_07)

       (pred_4 obj_06 obj_12)
       (pred_4 obj_06 obj_09)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_09 obj_10)
       (pred_4 obj_09 obj_06)
       (pred_4 obj_10 obj_11)
       (pred_4 obj_10 obj_20)
       (pred_4 obj_10 obj_09)
       (pred_4 obj_20 obj_19)
       (pred_4 obj_20 obj_10)
       (pred_4 obj_12 obj_03)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_12 obj_06)
       (pred_4 obj_02 obj_18)
       (pred_4 obj_02 obj_11)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_11 obj_16)
       (pred_4 obj_11 obj_19)
       (pred_4 obj_11 obj_10)
       (pred_4 obj_11 obj_02)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_19 obj_20)
       (pred_4 obj_19 obj_11)
       (pred_4 obj_03 obj_08)
       (pred_4 obj_03 obj_18)
       (pred_4 obj_03 obj_12)
       (pred_4 obj_18 obj_05)
       (pred_4 obj_18 obj_16)
       (pred_4 obj_18 obj_02)
       (pred_4 obj_18 obj_03)
       (pred_4 obj_16 obj_04)
       (pred_4 obj_16 obj_01)
       (pred_4 obj_16 obj_11)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_01 obj_13)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_08 obj_05)
       (pred_4 obj_08 obj_03)
       (pred_4 obj_05 obj_04)
       (pred_4 obj_05 obj_18)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_04 obj_13)
       (pred_4 obj_04 obj_16)
       (pred_4 obj_04 obj_05)
       (pred_4 obj_13 obj_01)
       (pred_4 obj_13 obj_04)
       (pred_2 obj_03)
       (pred_2 obj_12)
       (pred_12  obj_03 obj_14)
       (pred_12  obj_12 obj_17)
       (pred_6 obj_06)
       (pred_6 obj_09)
       (pred_6 obj_10)
       (pred_6 obj_20)
       (pred_6 obj_02)
       (pred_6 obj_11)
       (pred_6 obj_19)
       (pred_6 obj_18)
       (pred_6 obj_16)
       (pred_6 obj_01)
       (pred_6 obj_08)
       (pred_6 obj_05)
       (pred_6 obj_04)
       (pred_6 obj_13)

       (pred_8  obj_15 obj_14)
       (pred_8  obj_07 obj_17)
       (pred_9 obj_15 obj_13)
       (pred_9 obj_07 obj_06)
       (pred_11 obj_05)
    )

    (:goal (and
       (pred_9 obj_07 obj_09)
    ))
(:constraints
  (always (not (pred_11 obj_18)))
)
)

; plan
1. (op_4 obj_05 obj_04)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_04)
   goals met: 0 of 1
2. (op_4 obj_04 obj_16)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_16)
   goals met: 0 of 1
3. (op_4 obj_16 obj_11)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_11)
   goals met: 0 of 1
4. (op_4 obj_11 obj_10)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_10)
   goals met: 0 of 1
5. (op_4 obj_10 obj_09)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_09)
   goals met: 0 of 1
6. (op_4 obj_09 obj_06)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_06)
   goals met: 0 of 1
7. (op_5 obj_06 obj_07)
   deleted: (pred_9 obj_07 obj_06) (pred_10)
   added: (pred_1 obj_07)
   goals met: 0 of 1
8. (op_4 obj_06 obj_09)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_09)
   goals met: 0 of 1
9. (op_3 obj_09 obj_07)
   deleted: (pred_1 obj_07)
   added: (pred_10) (pred_9 obj_07 obj_09)
   goals met: 1 of 1
